/*
 *     리턴형   매개변수
 *     -------------------
 *       O          O -------> 1유형  ==> 로그인 : 사용자 입력값(id,pwd)
 *       O          X  ------> 2유형
 *       X          O -------> 3유형 ==> 자체 출력(void)
 *       ------------------
 *       X          X   (빈도수가 낮음)
 *       
 *       **메소드(범위 , 동작)를 만드는 목적(클래스 : 변수 , 메소드)
 *        1) 재사용 , 다른 클래스와 통신한다
 *        ------------------------------------------> 사람 <==> 자판기
 *                                                                        동전을 투입
 *       2) 반복제어
 *       3) 수정이 쉽게 구조화
 *       
 *      경우의 수
 *      로그인: 로그인 (o) ,로그인 (x)
 *                              
 */
public class 메소드_6 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
