/*
 *              반복문 --소스를 모아서 한번에 처리 
 *              ----------------------------------------------
 *              for (시작값;끝나는길;증가식)
 *              
 *              1~100
 *              for(int i=1;i<=100;i++)
 *              10~100 10개 증가
 *             for(int i=10; i<=100;i+=10)
 *           
 *              => 곱, 합, 갯수
 *                  gop=1   sum=0    count=0   => 산술연산     
 *                  gop*=i , sum+=i , count++
 *                  ---------------------------------
 *                                      
 *             ***변수 ==> 초기값
 *             ***연산자
 *             ***제어문
 *             ------------------------메소드(여러개를 모으면 CLASS) ===>암기(라이브러리)
 *                 
 *              형식)                                         
 *                      for(int i=1;i<=10;i++) 
 *                      {                                        
 *                    
 *                        system.out.println(i);
 *                      }            1      2              4                 
 *                      for(시작값;범위(끝);증가식)
 *                     { 반복실행문장 3
 *                     }
 *                     
 *                     1 2 3 4 
 *                        2 3 4
 *                        2 3 4 ==> 2가 false면 종료
 *                        
 *                        while : 무한루프 (종료 x): 종료하는 프로그램을 첨부
 *                                                                   게임 : ESC => system.exit(0)
 *                      => 데이터베이스(핵심)
 *                      
 *                      초기값---------1
 *                      while(조건식)----------2
 *                      {
 *                        반복 수행 문장 ---3
 *                        증가식 --------4 조건식 이동 (2)
 *                      }
 *                      1~100까지 정수 출력
 *                      int i=1;
 *                      while(i<=100)
 *                      {
 *                        출력
 *                        i++
 *                      }
 *                      
 */
public class 반복문_정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
